# str() - გადააქცევს ნებისმიერ მონაცემს სტრინგად (ტექსტად)
# int() - გადააქცევს რიცხვს ან რიცხვის მსგავს სტრინგს მთელი რიცხვად
# float() - გადააქცევს რიცხვს ათწილად რიცხვად

a = str(25)     # "25"
b = int("10")   # 10
c = float(5)    # 5.0


mother_age = int(input("შეიყვანე დედის ასაკი: "))
father_age = int(input("შეიყვანე მამის ასაკი: "))
my_age = int(input("შეიყვანე შენი ასაკი: "))

print("დედა 25 წლის შემდეგ იქნება:", mother_age + 25)
print("მამა 25 წლის შემდეგ იქნება:", father_age + 25)
print("მე 25 წლის შემდეგ ვიქნები:", my_age + 25)


name = input("შეიყვანე შენი სახელი: ")
print(type(name))   # გამოიტანს მონაცემის ტიპს (str)


age = input("შეიყვანე შენი ასაკი: ")
age_str = str(age)
print(type(age_str))   # იქნება <class 'str'>


a = 10
b = 5

print(a > b)   # მეტია ვიდრე
print(a < b)   # ნაკლებია ვიდრე
print(a == b)  # ტოლია
print(a != b)  # არ არის ტოლი
print(a >= b)  # მეტია ან ტოლია
print(a <= b)  # ნაკლებია ან ტოლია