# for loop გამოიყენება მაშინ, როცა წინასწარ ვიცით რამდენჯერ უნდა შესრულდეს ციკლი
# (მაგალითად range-ის გამოყენებით)

# while loop გამოიყენება მაშინ, როცა ციკლი უნდა გაგრძელდეს
# მანამ, სანამ პირობა ჭეშმარიტია (True)


for i in range(10, 39):
    print(i)


for i in range(3, 29):
    if i % 2 == 0:
        print(i)


for i in range(100, 501):
    if i % 2 == 1:
        print(i)



# while i > 10:
#     print("its less")
#     i = i + 1

# ეს კოდი არაფერს არ გამოიტანს,
# რადგან i ცვლადი არ არის განსაზღვრული (NameError)
# და პროგრამა შეცდომაზე გაჩერდება