# ინდექსინგი გამოიყენება მაშინ, როცა გვინდა ერთი კონკრეტული ელემენტის აღება.
# მაგალითად: name[0] → გამოიტანს მხოლოდ ერთ ასოს.

# სლაისინგი გამოიყენება მაშინ, როცა გვინდა რამდენიმე ელემენტის (ნაწილის) აღება.
# მაგალითად: name[0:3] → გამოიტანს ერთზე მეტ ასოს (ნაწილს).


surname = "Babaev"
print(surname[-5:])   # ბოლო 5 ასო


numbers = [1,2,3,4,5,6,7,8,9,10]

print(numbers[:3])    # პირველი სამი ელემენტი
print(numbers[-4:])   # ბოლო 4 ელემენტი
print(numbers[4:6])   # შუაში მყოფი ორი ელემენტი


user_surname = input("შეიყვანე შენი გვარი: ")
print(user_surname[::-1])   # შებრუნება


movie = "Venom"
print(movie[::2])   # ყოველი მეორე ასო



# ფუნქცია — კოდის ბლოკი, რომელიც ასრულებს მოქმედებას (მაგ: print()).
# არგუმენტი — მნიშვნელობა, რომელსაც ფუნქციას ვაძლევთ ფრჩხილებში.


print("welcome", "hi", range(1,10))
# გადაეცა 3 არგუმენტი.


int = "20"
print(int + 9)
# ერორია, რადგან "20" არის ტექსტი და 9 არის რიცხვი.


age = int(input("შეიყვანე ასაკი: "))
print(age + 10)